cf_billing/Documents/бестЗаявлениеНаЗаключениеДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестЗаявлениеНаЗаключениеДоговора</Name>
			<BasedOn>
				<xr:Item>Document.бестЗаявлениеНаЗаключениеДоговора</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестЭтапыЗаключенияДоговора</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапЗаключенияДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестВидыОперацийЗаключенийДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестЗаявлениеНаЗаключениеДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/бестЗаявлениеНаЗаключениеДоговора/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Отказ = ОбменДанными.Загрузка;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
	Если ДанныеЗаполнения = Неопределено тогда
		Возврат;
	КонецЕсли;
		
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения,,"Дата,Номер,ПериодНачисления");
	
	ПредыдущийЭтап 									= ДанныеЗаполнения.ЭтапЗаключенияДоговора; 
	ЭтапЗаключенияДоговора							= СледующийЭтапЗаключенияДоговора(ПредыдущийЭтап);
	Основание 										= ДанныеЗаполнения;
	
	Если ЭтапЗаключенияДоговора = Справочники.бестВидыОперацийЗаключенийДоговоров.ЭтапЗаключенияДоговора_ПередачаДоговораВАрхив тогда
		//// Заполняем табличную часть
		//Долги.Очистить();
		//
		//Если ЗначениеЗаполнено(ДанныеЗаполнения.СуммаГоспошлина) тогда
		//	СтрокаТЧ  								= Долги.Добавить();
		//	СтрокаТЧ.ВидДолга 						= "Гос пошлина";
		//	СтрокаТЧ.СуммаПоИсполнительномуЛисту 	= ДанныеЗаполнения.СуммаГоспошлина;
		//КонецЕсли;	
		//
		//Если ЗначениеЗаполнено(ДанныеЗаполнения.СуммаПеня) тогда
		//	СтрокаТЧ  								= Долги.Добавить();
		//	СтрокаТЧ.ВидДолга 						= "Пеня";
		//	СтрокаТЧ.СуммаПоИсполнительномуЛисту 	= ДанныеЗаполнения.СуммаПеня;
		//КонецЕсли;
		//
		//Если ЗначениеЗаполнено(ДанныеЗаполнения.СуммаЗадолженности) тогда
		//	СтрокаТЧ  								= Долги.Добавить();
		//	СтрокаТЧ.ВидДолга 						= "Сумма основного долга";
		//	СтрокаТЧ.СуммаПоИсполнительномуЛисту 	= ДанныеЗаполнения.СуммаЗадолженности;
		//КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СледующийЭтапЗаключенияДоговора(ПредыдущийЭтап)
	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ПредыдущийЭтап",ПредыдущийЭтап);
	Запрос.Текст 	="ВЫБРАТЬ
	|	бестВидыОперацийЗаключенийДоговоров.Ссылка КАК Этап
	|ИЗ
	|	(ВЫБРАТЬ
	|		МИНИМУМ(бестВидыОперацийЗаключенийДоговоров.Порядок) КАК Порядок
	|	ИЗ
	|		Справочник.бестВидыОперацийЗаключенийДоговоров КАК бестВидыОперацийЗаключенийДоговоров
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				бестВидыОперацийЗаключенийДоговоров.Порядок КАК Порядок
	|			ИЗ
	|				Справочник.бестВидыОперацийЗаключенийДоговоров КАК бестВидыОперацийЗаключенийДоговоров
	|			ГДЕ
	|				бестВидыОперацийЗаключенийДоговоров.Ссылка = &ПредыдущийЭтап) КАК ВложенныйЗапрос
	|			ПО (ВложенныйЗапрос.Порядок < бестВидыОперацийЗаключенийДоговоров.Порядок)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестВидыОперацийЗаключенийДоговоров КАК бестВидыОперацийЗаключенийДоговоров
	|		ПО ВложенныйЗапрос.Порядок = бестВидыОперацийЗаключенийДоговоров.Порядок";
	результат  = Запрос.Выполнить();
	Если результат.Пустой() тогда
		Возврат Справочники.бестВидыОперацийЗаключенийДоговоров.ПустаяСсылка();
	иначе
		Выборка = результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Этап;
	КонецЕсли; 
КонецФункции 

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
